src/ut10_old/Documents/ОтчетПоИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ОтчетПоИнвентаризации</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияТоваровНаСкладе</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументИнвентаризация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНедостачиФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНеРаспределеноНедостача</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверилИнвентаризацию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПерезачетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУдержаноФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеНедостачиПерезачеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидРаспределения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдержаноФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПровелиИнвентаризацию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ревизор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ut10_old/Enums/ВидРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидРаспределения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перезачет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ut10_old/Documents/ОтчетПоИнвентаризации/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ИзмененияФормы

&НаКлиенте
Процедура РаспределениеНедостачиПерезачетыСуммаПриИзменении(Элемент)
	Объект.СуммаПерезачетов				=	ПолучитьСуммуПерезачетов(); 
	Объект.СуммаНеРаспределеноНедостача	=	ПолучитьСуммуНеРаспределеноНедостачи(Объект.СуммаНедостачиФакт); 
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНедостачиПерезачетыВидРаспределенияПриИзменении(Элемент)
	Объект.СуммаПерезачетов				=	ПолучитьСуммуПерезачетов(); 
	Объект.СуммаНеРаспределеноНедостача	=	ПолучитьСуммуНеРаспределеноНедостачи(Объект.СуммаНедостачиФакт); 
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНедостачиПерезачетыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаПерезачетов				=	ПолучитьСуммуПерезачетов(); 
	Объект.СуммаНеРаспределеноНедостача	=	ПолучитьСуммуНеРаспределеноНедостачи(Объект.СуммаНедостачиФакт); 
	Объект.СуммаУдержаноФакт			=	Объект.РаспределениеНедостачиПерезачеты.Итог("УдержаноФакт"); 
КонецПроцедуры

&НаКлиенте
Процедура СуммаНедостачиФактПриИзменении(Элемент)
	Объект.СуммаНеРаспределеноНедостача	=	ПолучитьСуммуНеРаспределеноНедостачи(Объект.СуммаНедостачиФакт); 
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНедостачиПерезачетыУдержаноФактПриИзменении(Элемент)
	Объект.СуммаУдержаноФакт			=	Объект.РаспределениеНедостачиПерезачеты.Итог("УдержаноФакт"); 
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьСуммуПерезачетов();
	Структура = Новый Структура("ВидРаспределения", Перечисления.ВидРаспределения.Перезачет);
    ТЗ = Объект.РаспределениеНедостачиПерезачеты.Выгрузить(Структура,"Сумма");
	Возврат ТЗ.Итог("Сумма");	
КонецФункции

&НаСервере
Функция ПолучитьСуммуНеРаспределеноНедостачи(СуммаНедостачиФакт);
	Структура = Новый Структура("ВидРаспределения", Перечисления.ВидРаспределения.Недостача);
    ТЗ = Объект.РаспределениеНедостачиПерезачеты.Выгрузить(Структура,"Сумма");
	Возврат СуммаНедостачиФакт - ТЗ.Итог("Сумма");
КонецФункции

&НаКлиенте
Процедура РаспределениеНедостачиПерезачетыПослеУдаления(Элемент)
	Объект.СуммаПерезачетов				=	ПолучитьСуммуПерезачетов(); 
	Объект.СуммаНеРаспределеноНедостача	=	ПолучитьСуммуНеРаспределеноНедостачи(Объект.СуммаНедостачиФакт); 
	Объект.СуммаУдержаноФакт			=	Объект.РаспределениеНедостачиПерезачеты.Итог("УдержаноФакт"); 
КонецПроцедуры
